TexasInstruments/mcu_plus_sdk_am263x/source/security/security_common/drivers/hsmclient/utils/hsmclient_utils.c
	                       strcat(parsedConfig, "\r\n  dedFotaInfo       = 0x");
	                       lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 16);

	                       /* Interpret dedFotaInfo */
	                       lowerBits = configData[index] & 0xFFFFU;
	                       upperBits = (configData[index] >> 16U) & 0xFFU;
	                       strcat(parsedConfig, " (");
	                       if (lowerBits == BOTH_BANK_INVALID) {
	                           strcat(parsedConfig, "Both Banks Invalid");
	                       } else if (lowerBits == BOTH_BANKS_VALID) {
	                           strcat(parsedConfig, "Both Banks Valid");
	                       } else if (lowerBits == ONLY_BANK0_VALID) {
	                           strcat(parsedConfig, "Only Bank0 Valid");
	                       } else if (lowerBits == ONLY_BANK1_VALID) {
	                           strcat(parsedConfig, "Only Bank1 Valid");
	                       } else {
	                           strcat(parsedConfig, "Unknown Bank Status");
	                       }
	                       strcat(parsedConfig, ", Active: ");
	                       if (upperBits == BANK0_ACTIVE_VAL) {
	                           strcat(parsedConfig, "Bank0");
	                       } else if (upperBits == BANK1_ACTIVE_VAL) {
	                           strcat(parsedConfig, "Bank1");
	                       } else {
	                           strcat(parsedConfig, "Unknown");
	                       }
	                       strcat(parsedConfig, ")");
	                   }
#endif
	                   index++;

	                   strcat(parsedConfig, "\r\n  hsmPbistStatus    = 0x");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 16);
	                   
	                   /* Interpret hsmPbistStatus */
	                   strcat(parsedConfig, " (");
	                   if (configData[index] == 0U) {
	                       strcat(parsedConfig, "Not Run");
	                   } else {
	                       first = 1U;
	                       if (configData[index] & (1U << 0U)) {
	                           strcat(parsedConfig, "PBISTROM");
	                           first = 0U;
	                       }
	                       if (configData[index] & (1U << 1U)) {
	                           if (!first) strcat(parsedConfig, ", ");
	                           strcat(parsedConfig, "SECRAM");
	                           first = 0U;
	                       }
	                       if (configData[index] & (1U << 2U)) {
	                           if (!first) strcat(parsedConfig, ", ");
	                           strcat(parsedConfig, "BANK0");
	                           first = 0U;
	                       }
	                       if (configData[index] & (1U << 3U)) {
	                           if (!first) strcat(parsedConfig, ", ");
	                           strcat(parsedConfig, "BANK1");
	                           first = 0U;
	                       }
	                       if (configData[index] & (1U << 4U)) {
	                           if (!first) strcat(parsedConfig, ", ");
	                           strcat(parsedConfig, "BANK2");
	                           first = 0U;
	                       }
	                       if (configData[index] & (1U << 5U)) {
	                           if (!first) strcat(parsedConfig, ", ");
	                           strcat(parsedConfig, "BANK3");
	                           first = 0U;
	                       }
	                       strcat(parsedConfig, " Passed");
	                   }
	                   strcat(parsedConfig, ")");
	                   index++;
	                   
	                   /* Parse security configuration */
	                   strcat(parsedConfig, "\r\n[Security Configuration]");
	                   
#if defined (SOC_F29H85X)
	                   strcat(parsedConfig, "\r\n  C29 CPU2 SecCfg Validation = 0x");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 16);
	                   strcat(parsedConfig, (configData[index] == SECCFG_VALIDATION_SUCCESS) ? " (SUCCESS)" : " (FAILURE)");
	                   index++;
	                   
	                   strcat(parsedConfig, "\r\n  C29 CPU3 SecCfg Validation = 0x");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 16);
	                   strcat(parsedConfig, (configData[index] == SECCFG_VALIDATION_SUCCESS) ? " (SUCCESS)" : " (FAILURE)");
	                   index++;

					   strcat(parsedConfig, "\r\n  SW Revision SSU   = ");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 10);
	                   index++;
	                   
	                   strcat(parsedConfig, "\r\n  SW Revision SBL = ");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 10);
	                   index++;
	                   
	                   strcat(parsedConfig, "\r\n  SW Revision HSM   = ");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 10);
	                   index++;
					   
					   strcat(parsedConfig, "\r\n  SW Revision APP   = ");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 10);
	                   index++;

#elif defined (SOC_F29P32X)
	                   strcat(parsedConfig, "\r\n  C29 CPU2 SecCfg Validation = 0x");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 16);
	                   strcat(parsedConfig, (configData[index] == SECCFG_VALIDATION_SUCCESS) ? " (SUCCESS)" : " (FAILURE)");
	                   index++;
					   index++;	// reserved value, skip

					   strcat(parsedConfig, "\r\n  SW Revision SSU   = ");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 10);
	                   index++;
	                   
