TexasInstruments/mcu_plus_sdk_am263x/source/security/security_common/drivers/hsmclient/utils/hsmclient_utils.c
	                   strcat(parsedConfig, "\r\n  SW Revision SBL = ");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 10);
	                   index++;
	                   
	                   strcat(parsedConfig, "\r\n  SW Revision HSM   = ");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 10);
	                   index++;
					   
					   strcat(parsedConfig, "\r\n  SW Revision APP   = ");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 10);
	                   index++;
#else
					   index = index + 6U;	// reserved value, skip
#endif

	                   strcat(parsedConfig, "\r\n  Boot Retry Counts = 0x");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 16);
	                   strcat(parsedConfig, " (HSM: ");
	                   lib_itoa(configData[index] & 0xFFU, (uint8_t *)&parsedConfig[strlen(parsedConfig)], 10);
	                   strcat(parsedConfig, ", SBL: ");
	                   lib_itoa((configData[index] >> 8U) & 0xFFU, (uint8_t *)&parsedConfig[strlen(parsedConfig)], 10);
	                   strcat(parsedConfig, ")");
	                   index++;

#if defined (SOC_F29H85X) || defined (SOC_F29P32X)
	                   strcat(parsedConfig, "\r\n  HSM FW Update Status  = 0x");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 16);
	                   strcat(parsedConfig, (configData[index] == FW_UPDATE_COMPLETE) ? " (Complete)" : " (Incomplete)");
	                   index++;
	                   
	                   strcat(parsedConfig, "\r\n  SBL FW Update Status  = 0x");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 16);
	                   strcat(parsedConfig, (configData[index] == FW_UPDATE_COMPLETE) ? " (Complete)" : " (Incomplete)");
	                   index++;
	                   
	                   strcat(parsedConfig, "\r\n  C29 CPU1 FW Update Status = 0x");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 16);
	                   strcat(parsedConfig, (configData[index] == FW_UPDATE_COMPLETE) ? " (Complete)" : " (Incomplete)");
	                   index++;
	                   
	                   strcat(parsedConfig, "\r\n  C29 CPU3 FW Update Status = 0x");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 16);
	                   strcat(parsedConfig, (configData[index] == FW_UPDATE_COMPLETE) ? " (Complete)" : " (Incomplete)");
	                   index++;
#else
					   index = index + 4U;	// reserved value, skip
#endif

	                   /* Parse debug configuration */
	                   strcat(parsedConfig, "\r\n[Debug Configuration]");
	                   strcat(parsedConfig, "\r\n  Public Debug Status       = 0x");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 16);
	                   if (configData[index] == DEBUG_STATUS_DISABLED) {
	                       strcat(parsedConfig, " (Disabled)");
	                   } else if (configData[index] == DEBUG_STATUS_ENABLED) {
	                       strcat(parsedConfig, " (Enabled)");
	                   } else {
	                       strcat(parsedConfig, " (Unknown)");
	                   }
	                   index++;
	                   
	                   strcat(parsedConfig, "\r\n  Public Reg Access Status  = 0x");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 16);
	                   if (configData[index] == DEBUG_STATUS_DISABLED) {
	                       strcat(parsedConfig, " (Disabled)");
	                   } else if (configData[index] == DEBUG_STATUS_ENABLED) {
	                       strcat(parsedConfig, " (Enabled)");
	                   } else {
	                       strcat(parsedConfig, " (Unknown)");
	                   }
	                   index++;
	                   
	                   strcat(parsedConfig, "\r\n  Secure Debug Status       = 0x");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 16);
	                   if (configData[index] == DEBUG_STATUS_DISABLED) {
	                       strcat(parsedConfig, " (Disabled)");
	                   } else if (configData[index] == DEBUG_STATUS_ENABLED) {
	                       strcat(parsedConfig, " (Enabled)");
	                   } else {
	                       strcat(parsedConfig, " (Unknown)");
	                   }
	                   index++;
	                   
	                   strcat(parsedConfig, "\r\n  Secure Reg Access Status  = 0x");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 16);
	                   if (configData[index] == DEBUG_STATUS_DISABLED) {
	                       strcat(parsedConfig, " (Disabled)");
	                   } else if (configData[index] == DEBUG_STATUS_ENABLED) {
	                       strcat(parsedConfig, " (Enabled)");
	                   } else {
	                       strcat(parsedConfig, " (Unknown)");
	                   }
					   index++;
					   /* Parse keyring configuration */
					   strcat(parsedConfig, "\r\n[Keyring Status]");
	               	   strcat(parsedConfig, "\r\n  Number of keys imported       = ");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 10);
	                   index++;
	               
	                   strcat(parsedConfig, "\r\n  Number of asymmetric keys imported  = ");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 10);
	                   index++;
	               
	                   strcat(parsedConfig, "\r\n  Number of symmetric keys imported  = ");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 10);
	                   index++;
	               
	                   strcat(parsedConfig, "\r\n  Number of asymmetric private keys imported  = ");
	                   lib_itoa(configData[index], (uint8_t *)&parsedConfig[strlen(parsedConfig)], 10);
				       index++;

				       strcat(parsedConfig, "\r\n  Custom keyring data imported  = ");
				       if (configData[index] == 1U) 
				   		{
							strcat(parsedConfig, "yes");
				   		} else {
							strcat(parsedConfig, "no");
				   		}
	                   
	                   status = SystemP_SUCCESS;
	               }
	           }
	           break;
	           
	       default:
	           status = SystemP_FAILURE;
	           break;
	   }
	   
	   return status;
}
